<a href="https://colab.research.google.com/github/varshitverma/18CSE138/blob/main/18cse138_DMDW2_Assignment_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**DMDW Experiment-2**

world university ranking

In [1]:
#Load data
path = 'https://raw.githubusercontent.com/varshitverma/18CSE138/main/cwurData.csv'

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv(path)

In [4]:
data

      world_rank                            institution  ...   score  year
0              1                     Harvard University  ...  100.00  2012
1              2  Massachusetts Institute of Technology  ...   91.67  2012
2              3                    Stanford University  ...   89.50  2012
3              4                University of Cambridge  ...   86.17  2012
4              5     California Institute of Technology  ...   85.21  2012
...          ...                                    ...  ...     ...   ...
2195         996              University of the Algarve  ...   44.03  2015
2196         997                  Alexandria University  ...   44.03  2015
2197         998            Federal University of Ceará  ...   44.03  2015
2198         999                 University of A Coruña  ...   44.02  2015
2199        1000        China Pharmaceutical University  ...   44.02  2015

[2200 rows x 14 columns]

In [5]:
type(data)

pandas.core.frame.DataFrame

In [6]:
data.shape

(2200, 14)

#Data Exploration

In [7]:
data.info() #if any numeric column has datatype object then there is error

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   world_rank            2200 non-null   int64
 1   institution           2200 non-null   object
 2   country               2200 non-null   object
 3   national_rank         2200 non-null   int64
 4   quality_of_education  2200 non-null   int64
 5   alumni_employment     2200 non-null   int64
 6   quality_of_faculty    2200 non-null   int64
 7   publications          2200 non-null   int64
 8   influence             2200 non-null   int64
 9   citations             2200 non-null   int64
 10  broad_impact          2000 non-null   float64
 11  patents               2200 non-null   int64
 12  score                 2200 non-null   float64
 13  year                  2200 non-null   int64
dtypes: float64(2), int64(10), object(2)
memory usage: 240.8+ KB

In [8]:
data.index

RangeIndex(start=0, stop=2200, step=1)

In [9]:
data.columns

Index(['world_rank', 'institution', 'country', 'national_rank',
       'quality_of_education', 'alumni_employment', 'quality_of_faculty',
       'publications', 'influence', 'citations', 'broad_impact', 'patents',
       'score', 'year'],
      dtype='object')

In [10]:
data.head()

   world_rank                            institution  ...   score  year
0           1                     Harvard University  ...  100.00  2012
1           2  Massachusetts Institute of Technology  ...   91.67  2012
2           3                    Stanford University  ...   89.50  2012
3           4                University of Cambridge  ...   86.17  2012
4           5     California Institute of Technology  ...   85.21  2012

[5 rows x 14 columns]

In [11]:
data.tail()

      world_rank                      institution  ...  score  year
2195         996        University of the Algarve  ...  44.03  2015
2196         997            Alexandria University  ...  44.03  2015
2197         998      Federal University of Ceará  ...  44.03  2015
2198         999           University of A Coruña  ...  44.02  2015
2199        1000  China Pharmaceutical University  ...  44.02  2015

[5 rows x 14 columns]

In [12]:
data.head(5)

   world_rank                            institution  ...   score  year
0           1                     Harvard University  ...  100.00  2012
1           2  Massachusetts Institute of Technology  ...   91.67  2012
2           3                    Stanford University  ...   89.50  2012
3           4                University of Cambridge  ...   86.17  2012
4           5     California Institute of Technology  ...   85.21  2012

[5 rows x 14 columns]

In [13]:
data[['institution',"country"]].head(10)

                             institution         country
0                     Harvard University             USA
1  Massachusetts Institute of Technology             USA
2                    Stanford University             USA
3                University of Cambridge  United Kingdom
4     California Institute of Technology             USA
5                   Princeton University             USA
6                   University of Oxford  United Kingdom
7                        Yale University             USA
8                    Columbia University             USA
9     University of California, Berkeley             USA

In [19]:
data.country.unique()

array(['USA', 'United Kingdom', 'Japan', 'Switzerland', 'Israel',
       'South Korea', 'Canada', 'France', 'Russia', 'China', 'Taiwan',
       'Sweden', 'Singapore', 'Denmark', 'Germany', 'Netherlands',
       'Italy', 'Belgium', 'Australia', 'Finland', 'Norway',
       'South Africa', 'Spain', 'Brazil', 'Hong Kong', 'Ireland',
       'Austria', 'New Zealand', 'Portugal', 'Thailand', 'Czech Republic',
       'Malaysia', 'India', 'Greece', 'Mexico', 'Hungary', 'Argentina',
       'Turkey', 'Poland', 'Saudi Arabia', 'Chile', 'Iceland', 'Slovenia',
       'Estonia', 'Lebanon', 'Croatia', 'Colombia', 'Slovak Republic',
       'Iran', 'Egypt', 'Serbia', 'Bulgaria', 'Lithuania', 'Uganda',
       'United Arab Emirates', 'Uruguay', 'Cyprus', 'Romania',
       'Puerto Rico'], dtype=object)

In [16]:
data.shape

(2000, 14)

In [17]:
data.head

<bound method NDFrame.head of       world_rank                            institution  ...   score  year
200            1                     Harvard University  ...  100.00  2014
201            2                    Stanford University  ...   99.09  2014
202            3  Massachusetts Institute of Technology  ...   98.69  2014
203            4                University of Cambridge  ...   97.64  2014
204            5                   University of Oxford  ...   97.51  2014
...          ...                                    ...  ...     ...   ...
2195         996              University of the Algarve  ...   44.03  2015
2196         997                  Alexandria University  ...   44.03  2015
2197         998            Federal University of Ceará  ...   44.03  2015
2198         999                 University of A Coruña  ...   44.02  2015
2199        1000        China Pharmaceutical University  ...   44.02  2015

[2000 rows x 14 columns]>

#Data cleaning

In [15]:
data.dropna(inplace=True) # removed the null values 1st method remove rows when large data we having
data.isnull().sum()

world_rank              0
institution             0
country                 0
national_rank           0
quality_of_education    0
alumni_employment       0
quality_of_faculty      0
publications            0
influence               0
citations               0
broad_impact            0
patents                 0
score                   0
year                    0
dtype: int64

In [14]:
data.isnull().sum()

world_rank                0
institution               0
country                   0
national_rank             0
quality_of_education      0
alumni_employment         0
quality_of_faculty        0
publications              0
influence                 0
citations                 0
broad_impact            200
patents                   0
score                     0
year                      0
dtype: int64

In [23]:
#check for duplicates
data.duplicated().sum()

0

In [22]:
##check for missing values
data.isnull().sum()

world_rank              0
institution             0
country                 0
national_rank           0
quality_of_education    0
alumni_employment       0
quality_of_faculty      0
publications            0
influence               0
citations               0
broad_impact            0
patents                 0
score                   0
year                    0
dtype: int64

In [25]:
data.describe()

        world_rank  national_rank  ...        score         year
count  2000.000000    2000.000000  ...  2000.000000  2000.000000
mean    500.500000      42.518000  ...    47.067630  2014.500000
std     288.747186      53.444193  ...     6.590461     0.500125
min       1.000000       1.000000  ...    44.020000  2014.000000
25%     250.750000       7.000000  ...    44.440000  2014.000000
50%     500.500000      22.000000  ...    44.960000  2014.500000
75%     750.250000      52.000000  ...    46.812500  2015.000000
max    1000.000000     229.000000  ...   100.000000  2015.000000

[8 rows x 12 columns]

In [26]:
data

      world_rank                            institution  ...   score  year
200            1                     Harvard University  ...  100.00  2014
201            2                    Stanford University  ...   99.09  2014
202            3  Massachusetts Institute of Technology  ...   98.69  2014
203            4                University of Cambridge  ...   97.64  2014
204            5                   University of Oxford  ...   97.51  2014
...          ...                                    ...  ...     ...   ...
2195         996              University of the Algarve  ...   44.03  2015
2196         997                  Alexandria University  ...   44.03  2015
2197         998            Federal University of Ceará  ...   44.03  2015
2198         999                 University of A Coruña  ...   44.02  2015
2199        1000        China Pharmaceutical University  ...   44.02  2015

[2000 rows x 14 columns]